[
  {
    "name": "UI-Writing-TOEIC-test",
    "description": "Ứng dụng web luyện thi TOEIC Writing với giao diện hiện đại, hỗ trợ đa dạng dạng bài.",
    "tags": ["Angular", "SCSS", "UI/UX", "TOEIC"],
    "repo": "https://github.com/TrungKienSilly/UI-Writing-TOEIC-test",
    "demo": "writing-toeic/index.html",
    "detailedInfo": {
      "fullDescription": "Ứng dụng luyện thi TOEIC Writing được xây dựng bằng Angular framework với giao diện thân thiện, trực quan. Hỗ trợ 3 dạng bài chính: viết câu mô tả ảnh, trả lời email và viết luận theo chuẩn TOEIC.",
      "features": [
        "3 dạng bài TOEIC Writing: viết câu từ ảnh, trả lời email, viết luận",
        "Giao diện hiện đại với gradient design và animations",
        "Responsive hoàn toàn trên mọi thiết bị (mobile, tablet, desktop)",
        "Hệ thống timer đếm ngược cho từng bài tập",
        "Auto-save câu trả lời để tránh mất dữ liệu",
        "Highlight và gợi ý ngữ pháp thông minh"
      ],
      "technologies": "Angular, TypeScript, SCSS, HTML5, Responsive Design",
      "status": "Hoàn thành"
    }
  },
  {
    "name": "TrungKienSilly",
    "description": "GitHub Profile README — Trang giới thiệu cá nhân với thống kê và thông tin dự án.",
    "tags": ["Profile", "GitHub", "Markdown"],
    "repo": "https://github.com/TrungKienSilly/TrungKienSilly",
    "detailedInfo": {
      "fullDescription": "Repository đặc biệt chứa README profile hiển thị trên trang GitHub cá nhân. Bao gồm giới thiệu bản thân, kỹ năng lập trình, công nghệ sử dụng, thống kê GitHub và liên kết đến các dự án nổi bật.",
      "features": [
        "README profile tùy chỉnh với badges và icons",
        "Thống kê GitHub tự động (GitHub Stats, Top Languages)",
        "Danh sách kỹ năng với logo công nghệ (shields.io)",
        "Giới thiệu dự án nổi bật với links",
        "Thông tin liên hệ và social media",
        "GitHub streak và activity graph"
      ],
      "technologies": "Markdown, GitHub Profile README, Shields.io Badges",
      "status": "Đang cập nhật thường xuyên"
    }
  },
  {
    "name": "Warmguys",
    "description": "Hệ thống quản lý phòng gym toàn diện với module Admin & User, quản lý thiết bị, gói tập và email tự động.",
    "tags": ["PHP", "MySQL", "MVC", "PHPMailer"],
    "repo": "https://github.com/TrungKienSilly/Warmguys",
    "demo": "https://tienchung21.github.io/warmguys/View/User/about.html",
    "detailedInfo": {
      "fullDescription": "Ứng dụng quản lý phòng tập gym được xây dựng theo mô hình MVC với PHP thuần và MySQL. Bao gồm 2 giao diện riêng biệt: Admin (quản trị viên) và User (thành viên), hỗ trợ quản lý thiết bị, gói tập, hóa đơn, và gửi thông báo qua email.",
      "features": [
        "Quản lý thiết bị gym (CRUD, cập nhật trạng thái, hình ảnh, bảo trì)",
        "Quản lý thành viên và theo dõi lịch sử tập luyện",
        "Quản lý gói tập, khuyến mãi và gia hạn tự động",
        "Quản lý hóa đơn, thanh toán và thống kê doanh thu",
        "Gửi thông báo/nhắc nhở tự động qua email (PHPMailer)",
        "Dashboard với biểu đồ thống kê (Morris.js, ApexCharts)",
        "Giao diện Admin/User tách biệt với nhiều vendor libraries"
      ],
      "technologies": "PHP (mysqli), MySQL/MariaDB, HTML5, CSS3, JavaScript (jQuery), PHPMailer, Morris.js, ApexCharts",
      "status": "Hoàn thành (đang cải thiện bảo mật)"
    }
  },
  {
    "name": "TOEIC Speaking Test Website",
    "description": "Ứng dụng luyện phát âm TOEIC Speaking với Azure AI, Angular 20, SSR và chấm điểm tự động thông minh.",
    "tags": ["Angular 20", "TypeScript", "Azure AI", "SSR", "TOEIC"],
    "repo": "https://github.com/TrungKienSilly/TOEIC_Speaking_Test_Website",
    "demo": "TOEIC_Speaking_Test_Website/index.html",
    "detailedInfo": {
      "fullDescription": "Ứng dụng web luyện phát âm tiếng Anh cho kỳ thi TOEIC Speaking, xây dựng bằng Angular 20 với kiến trúc standalone component, signals và zoneless change detection. Tích hợp Azure Cognitive Services để đánh giá phát âm chính xác theo 4 tiêu chí, hỗ trợ Server-Side Rendering (SSR) với Express.",
      "features": [
        "Luyện phát âm 10 chủ đề nguyên âm với 500+ từ vựng theo IPA",
        "Azure Pronunciation Assessment: chấm điểm Accuracy, Completeness, Fluency, Overall",
        "Phân tích âm tiết chi tiết với hệ thống penalty thông minh",
        "Text-to-Speech hỗ trợ giọng Mỹ (US) và Anh (UK)",
        "Countdown timer, quản lý quyền microphone, trạng thái trực quan",
        "Server-Side Rendering (SSR) với Angular Universal và Express",
        "Responsive design, error handling SSR, Web Audio API"
      ],
      "technologies": "Angular 20, TypeScript, Azure Cognitive Services Speech SDK, Angular Universal, Express.js, SCSS, Web Audio API, Jasmine/Karma",
      "status": "Hoàn thành - Production Ready"
    }
  },
  {
    "name": "Hệ thống tuyển sinh ĐH",
    "description": "Hệ thống quản lý và tư vấn tuyển sinh đại học, tìm kiếm trường theo điểm chuẩn với PHP và MySQL.",
    "tags": ["PHP", "MySQL", "Admin Panel", "Search"],
    "repo": "https://github.com/TrungKienSilly/tuyensinh",
    "demo": "tuyensinh/index.html",
    "detailedInfo": {
      "fullDescription": "Hệ thống quản lý thông tin các trường đại học tuyển sinh toàn quốc, hỗ trợ học sinh tìm kiếm và lựa chọn trường phù hợp dựa trên điểm thi tốt nghiệp. Bao gồm frontend cho người dùng và admin panel quản lý dữ liệu.",
      "features": [
        "Tìm kiếm trường theo tên, tỉnh/thành, loại trường, ngành học",
        "Tìm kiếm nâng cao theo điểm chuẩn và khối thi",
        "Xem chi tiết trường: thông tin, ngành đào tạo, điểm chuẩn",
        "Admin panel: CRUD trường, ngành, điểm chuẩn theo năm",
        "Import dữ liệu hàng loạt từ file CSV",
        "Dashboard thống kê tổng quan hệ thống",
        "Responsive design, sắp xếp và lọc kết quả đa tiêu chí"
      ],
      "technologies": "PHP 7.4+, MySQL 5.7+, HTML5, CSS3, JavaScript, Responsive CSS",
      "status": "Hoàn thành"
    }
  },
  {
    "name": "TOP1DATSAN",
    "description": "Hệ thống đặt sân bóng B2B với ví điện tử, thanh toán VNPAY, quản lý booking và PHPMailer.",
    "tags": ["PHP", "MySQL", "VNPAY", "PDO", "E-Wallet"],
    "repo": "https://github.com/TrungKienSilly/top1datsan",
    "demo": "top1datsan/index.html",
    "detailedInfo": {
      "fullDescription": "Nền tảng đặt sân thể thao B2B dành cho doanh nghiệp, câu lạc bộ và đội bóng. Xây dựng bằng PHP với PDO/MySQL, tích hợp ví điện tử và thanh toán VNPAY, kèm trang quản trị và hệ thống email tự động.",
      "features": [
        "Đặt lịch sân theo giờ với lịch thời gian trực quan",
        "Quản lý booking B2B (công ty, CLB, đội bóng)",
        "Ví điện tử: nạp tiền, thanh toán, lịch sử giao dịch",
        "Tích hợp thanh toán VNPAY (sandbox & production)",
        "Trang quản trị: quản lý sân, đặt sân, nhân viên, khách hàng",
        "Gửi email xác nhận đặt sân và nhắc nhở (PHPMailer)",
        "Đánh giá và review sân, xem lịch sử đặt sân"
      ],
      "technologies": "PHP 7.4+, MySQL/MariaDB, PDO, VNPAY API, PHPMailer, jQuery, Bootstrap, SCSS",
      "status": "Hoàn thành (khuyến nghị nâng cấp bảo mật)"
    }
  },
  {
    "name": "Dudoandiemchuan-daihoc",
    "description": "Hệ thống Dự đoán Điểm chuẩn Đại học - Công cụ hỗ trợ thí sinh dự đoán khả năng đậu học rớt cho từng nguyện vọng đại học.",
    "tags": ["PHP", "Python", "AI", "CSS", "MySQL"],
    "repo": "https://github.com/TrungKienSilly/Dudoandiemchuan-daihoc",
    "detailedInfo": {
      "fullDescription": "Hệ thống tra cứu và dự đoán điểm chuẩn tuyển sinh đại học với tích hợp AI thông minh, giúp thí sinh đưa ra quyết định và xử hướng tuyển sinh dễ dùa ra tỷ lệ ước tính, giúp học sinh tham khảo và sắp xếp nguyện vọng hợp lý hơn.",
      "features": [
        "Tìm kiếm trường đại học theo tên, ngành, khu vực và điểm chuẩn",
        "Dự đoán khả năng trúng tuyển dựa trên điểm thi và nguyện vọng",
        "Tra cứu lịch sử điểm chuẩn các năm trước",
        "Tích hợp AI để phân tích dữ liệu điểm chuẩn và xu hướng",
        "Hệ thống phân tích dữ liệu điểm chuẩn và xử lý nguyện vọng",
        "Giao diện thân thiện, dễ sử dụng cho học sinh",
        "API Python để xử lý các thuật toán dự đoán phức tạp"
      ],
      "technologies": "PHP 8.1%, CSS 13.0%, Python 5.2%, MySQL, AI/Machine Learning",
      "status": "Hoàn thành"
    }
  }
]